# -*-coding:utf-8-*_
from collections import namedtuple


Label = namedtuple(
    'Label', ['id', 'categoryId', 'label', 'name'])

arrow_labels = {
    Label(0,    0,      "0",    u"其他"),
    Label(1,    1,      "1",    u"直行标志"),
    Label(2,    2,      "2",    u"前方左转标志"),
    Label(3,    3,      "3",    u"前方右转标志"),
    Label(4,    4,      "4",    u"直行或左转标志"),
    Label(5,    5,      "5",    u"直行或右转标志"),
    Label(6,    6,      "6",    u"前方掉头标志"),
    Label(7,    7,      "7",    u"前方可直行或掉头标志"),
    Label(8,    8,      "8",    u"前方可左转或掉头标志"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"前方道路有左弯或需向左合流标"),
    Label(11,   11,     "11",   u"前方道路有右弯或需向右合流标"),
    Label(12,   12,     "12",   u"文字"),
    Label(13,   13,     "13",   u"数字"),
    Label(14,   14,     "14",   u"符号"),
}

arrow_labels_v2 = {
    Label(0,    0,      "0",    u"其他"),
    Label(1,    1,      "1",    u"直行标志"),
    Label(2,    2,      "2",    u"前方左转标志"),
    Label(3,    3,      "3",    u"前方右转标志"),
    Label(4,    4,      "4",    u"直行或左转标志"),
    Label(5,    5,      "5",    u"直行或右转标志"),
    Label(6,    6,      "6",    u"前方掉头标志"),
    Label(7,    7,      "7",    u"前方可直行或掉头标志"),
    Label(8,    8,      "8",    u"前方可左转或掉头标志"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"前方道路有左弯或需向左合流标"),
    Label(11,   11,     "11",   u"前方道路有右弯或需向右合流标"),
    Label(12,   12,     "12",   u"文字"),
    Label(13,   12,     "13",   u"数字"),
    Label(14,   13,     "14",   u"符号"),
}
arrow_labels_cls12 = {
    Label(0,    0,      "0",    u"其他"),
    Label(1,    1,      "1",    u"直行标志"),
    Label(2,    2,      "2",    u"前方左转标志"),
    Label(3,    3,      "3",    u"前方右转标志"),
    Label(4,    4,      "4",    u"直行或左转标志"),
    Label(5,    5,      "5",    u"直行或右转标志"),
    Label(6,    6,      "6",    u"前方掉头标志"),
    Label(7,    7,      "7",    u"前方可直行或掉头标志"),
    Label(8,    8,      "8",    u"前方可左转或掉头标志"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"前方道路有左弯或需向左合流标"),
    Label(11,   11,     "11",   u"前方道路有右弯或需向右合流标"),
    # Label(12,   0,     "12",   u"文字"),
    # Label(13,   0,     "13",   u"数字"),
    # Label(14,   0,     "14",   u"符号"),
}



arrow_labels_v3 = {
    Label(0,    0,      "0",    u"直行"),
    Label(1,    1,      "1",    u"左转"),
    Label(2,    2,      "2",    u"右转"),
    Label(3,    3,      "3",    u"掉头"),
    Label(4,    4,      "4",    u"汇入"),
    Label(5,    5,      "5",    u"直行加左转"),
    Label(6,    6,      "6",    u"直行加右转"),
    Label(7,    7,      "7",    u"直行加掉头"),
    Label(8,    8,      "8",    u"左转加掉头"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"左转加右转"),
    Label(11,   11,     "11",   u"右转加掉头"),
    Label(12,   12,     "12",   u"直行加掉头"),
    Label(13,   13,     "13",   u"无法判断箭头含义"),
    Label(14,   14,     "14",   u"符号或文字或其他标志"),
}

arrow_labels_v4 = {
    Label(0,    0,      "0",    u"直行"),
    Label(1,    1,      "1",    u"左转"),
    Label(2,    2,      "2",    u"右转"),
    Label(3,    3,      "3",    u"掉头"),
    Label(4,    4,      "4",    u"左汇入"),
    Label(5,    5,      "5",    u"直行加左转"),
    Label(6,    6,      "6",    u"直行加右转"),
    Label(7,    7,      "7",    u"直行加掉头"),
    Label(8,    8,      "8",    u"左转加掉头"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"右汇入"),
    Label(11,   11,     "11",   u"无法判断箭头含义"),
    Label(12,   12,     "12",   u"符号或文字或其他标志"),
    #10类为右转加掉头 所以redress_v1中的12 为无法判断+符号文字
}
arrow_labels_v4_test = {
    Label(0,    0,      "0",    u"直行"),
    Label(1,    1,      "1",    u"左转"),
    Label(2,    2,      "2",    u"右转"),
    Label(3,    3,      "3",    u"掉头"),
    Label(4,    4,      "4",    u"左汇入"),
    Label(5,    5,      "5",    u"直行加左转"),
    Label(6,    6,      "6",    u"直行加右转"),
    Label(7,    7,      "7",    u"直行加掉头"),
    Label(8,    8,      "8",    u"左转加掉头"),
    Label(9,    9,      "9",    u"左右转"),
    Label(10,   10,     "10",   u"右转加掉头"),
    Label(11,   11,     "11",   u"右汇入"),
    Label(12,   12,     "12",   u"符号或文字或其他标志"),
}

arrow_labels_v5 = {
    Label(0,    0,      "0",    u"其他"),
    Label(1,    1,      "1",    u"直行标志"),
    Label(2,    2,      "2",    u"前方左转标志"),
    Label(3,    3,      "3",    u"前方右转标志"),
    Label(4,    4,      "4",    u"直行或左转标志"),
    Label(5,    5,      "5",    u"直行或右转标志"),
    Label(6,    6,      "6",    u"前方掉头标志"),
    Label(7,    7,      "7",    u"前方可直行或掉头标志"),
    Label(8,    8,      "8",    u"前方可左转或掉头标志"),
    Label(9,    9,      "9",    u"前方道路仅可左右转弯标志"),
    Label(10,   10,     "10",   u"前方道路有左弯或需向左合流标"),
    Label(11,   11,     "11",   u"前方道路有右弯或需向右合流标"),
    Label(12,   12,     "12",   u"无法判断箭头含义"),
    Label(13,   13,     "13",   u"符号或文字或其他标志"),
}

ton_fur_labels = {
    Label(0,    0,      "0",    u"白苔"),
    Label(1,    1,      "1",    u"地图舌"),
    Label(2,    2,      "2",    u"腐苔"),
    Label(3,    3,      "3",    u"黑苔"),
    Label(4,    4,      "4",    u"黄苔"),
    Label(5,    5,      "5",    u"镜面舌"),
    Label(6,    6,      "6",    u"腻苔"),
}